/*******************************************************************************
*                 
*                 		       普中科技
--------------------------------------------------------------------------------
* 实 验 名		 : LED灯闪烁实验
* 实验说明       : 通过delay延时实现LED灯闪烁效果
* 连接方式       : 
* 注    意		 : 	延时函数及显示函数在led.c文件内
*******************************************************************************/

#include "public.h" //公共函数头文件
					/****************************************************************************
* Function Name  : main
* Description    : Main program.
* Input          : None
* Output         : None
* Return         : None
****************************************************************************/
int main()
{
	
	LED_Init(); //LED端口及时钟初始化
	while (1)
	{		
		led_display(); //led显示		
	}
	
}
